app/controllers/criancas_controller.rb

  def mat2pre_edit

    @unidade_regiao= Unidade.find(:all , :conditions=>[' ativo = 1 AND ( tipo = 1 or tipo = 3 or tipo = 7 or tipo = 8)'])
     session[:sim]= 1
    @crianca = Crianca.find(params[:id])
---
SELECT * FROM `unidades` WHERE ((tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) and (id not between 70 and 83) and (id <> 54) AND ativo = 1) ORDER BY nome
SELECT * FROM `vaga_criancas` WHERE (`vaga_criancas`.crianca_id = 13657)

def show_pre
     @crianca = Crianca.find(session[:crianca_id])
     @unidade_regiao= Unidade.find(:all , :conditions=>['regiao_id=? AND ativo = 1 AND ( tipo = 1 or tipo = 3 or tipo = 7 or tipo = 8)',@crianca.regiao_id])
---
SELECT * FROM `criancas` WHERE (`criancas`.`id` = 13786)
SELECT * FROM `unidades` WHERE ((tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) and (id not between 70 and 83) and (id <> 54) AND ativo = 1 ) ORDER BY nome

  def show
     @crianca = Crianca.find(params[:id])
     @unidade_regiao= Unidade.find(:all , :conditions=>['regiao_id=? AND ativo = 1 AND ( tipo = 1 or tipo = 3 or tipo = 7 or tipo = 8)',@crianca.regiao_id])
---
SELECT * FROM `criancas` WHERE (`criancas`.`id` = 0)
SELECT * FROM `regiaos` WHERE (`regiaos`.`id` = 102)
SELECT * FROM `unidades` WHERE ((tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) and (id not between 70 and 83) and (id <> 54) AND ativo = 1 ) ORDER BY nome

  def edit
     @unidade_regiao= Unidade.find(:all , :conditions=>[' ativo = 1 AND ( tipo = 1 or tipo = 3 or tipo = 7 or tipo = 8)'])
     session[:sim]= 1
    @crianca = Crianca.find(params[:id])
---
SELECT * FROM `unidades` WHERE ((tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) and (id not between 70 and 83) and (id <> 54) AND ativo = 1 ) ORDER BY nome
SELECT * FROM `vaga_criancas` WHERE (`vaga_criancas`.crianca_id = 13218)

  def edit_pre
    @unidade_regiao= Unidade.find(:all , :conditions=>[' ativo = 1 AND ( tipo = 1 or tipo = 3 or tipo = 7 or tipo = 8)'])
     session[:sim]= 1
    @crianca = Crianca.find(params[:id])
---
SELECT * FROM `unidades` WHERE ((tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) and (id not between 70 and 83) and (id <> 54) AND ativo = 1) ORDER BY nome
SELECT * FROM `vaga_criancas` WHERE (`vaga_criancas`.crianca_id = 12960)

 def alteracao_status
    @crianca = Crianca.find(params[:id])
    w1=params[:id]
    w=@crianca.regiao_id
    @unidade_regiao= Unidade.find(:all , :conditions=>['regiao_id=? AND ativo = 1 AND ( tipo = 1 or tipo = 3 or tipo = 7 or tipo = 8)',@crianca.regiao_id])
---
SELECT * FROM `criancas` WHERE (`criancas`.`id` = 13783)
SELECT * FROM `regiaos` WHERE (`regiaos`.`id` = 999)
SELECT * FROM `unidades` WHERE ((tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) and (id not between 70 and 83) and (id <> 54) AND ativo = 1 ) ORDER BY nome

  def create
    @crianca = Crianca.new(params[:crianca])
      if session[:nasc]==1
          session[:nasc]=0
          t=0
                  # ALTERAR TAMBÈM AS DATAS NO ALETRACAOS_CONTROLER def alterar_classe e no def update
                    @crianca.unidade_id = current_user.unidade_id
                    if session[:show_transferencia]==1
                        @crianca.nascimento = session[:dataN]
                        @crianca.save
---
INSERT INTO `criancas` (`tel1`, `tel2`, `celular`, `trabalho`, `declaracao`, `matriculado`, `recadastrada`, `n_especial`, `bairro_indicacao`, `irmao_nome`, `servidor_publico`, `autonomo`, `obs`, `necessidade`, `unidade_ref`, `bairro`, `num_indicacao`, `vaga_id`, `photo_file_size`, `responsavel_n`, `matricula`, `unidade_i`, `unidade_t`, `data_rec`, `created_at`, `nome`, `endereco`, `num_trab`, `mae`, `sexo`, `complemento`, `justif_indicacao`, `pai`, `vaga`, `numero`, `end_indicacao`, `vinculo`, `transferencia`, `servidor_local`, `nascimento`, `bairro_trab`, `parentesco`, `irmao`, `opcao1`, `opcao2`, `opcao3`, `local_rec`, `photo_file_name`, `photo_content_type`, `regiao_id`, `end_trab`, `responsavel`, `fone_trabalho`, `periodo`, `status`, `unidade_id`, `grupo_id`, `nomerecado`, `local_trabalho`, `atividade_autonomo`, `updated_at`) VALUES('testeteteetetetetet novo', '', 'testeteteetetetetet novo', 0, 0, NULL, 1, 0, '', NULL, 0, 0, NULL, '', 'CR CURIMA', '', '', NULL, NULL, 'TESTETETEETETETETET NOVO', '', '', NULL, NULL, '2020-09-04 14:32:55', 'TESTETETEETETETETET NOVO', 'TESTETETEETETETETET NOVO', '', 'TESTETETEETETETETET NOVO', NULL, '', '', '', NULL, '', '', '', 0, '', '2016-05-29 03:00:00', '', 'PRIMO(A)', 0, 'não trabalha', NULL, NULL, NULL, NULL, NULL, 107, NULL, NULL, '', NULL, 'NA_DEMANDA', 52, 6, 'TESTETETEETETETETET NOVO', '', NULL, '2020-09-04 14:32:55')

                          @crianca.transferencia = true
                   end
                    respond_to do |format|
                      if @crianca.save
---
UPDATE `criancas` SET `regiao_id` = 999, `opcao1` = 'não trabalha', `updated_at` = '2020-08-31 15:03:19' WHERE `id` = 13786

                            @crianca.save
                              if session[:ficha_pre]==1
                                   if @crianca.nascimento.strftime("%Y%m%d").to_i < DATA_FIM_PRE.to_i    #   20170630 LIMITE PRE
                                             @crianca.destroy
---
DELETE FROM `criancas` WHERE `id` = 13790

  def update
    @crianca = Crianca.find(params[:id])
    if session[:acerto] = 1
        w=@crianca.recadastrada = session[:acertorecadastrada]
        session[:acerto]=0
    end
   id=@crianca.id
   @crianca.update_attributes(params[:crianca])
---
SELECT * FROM `vaga_criancas` WHERE (`vaga_criancas`.crianca_id = 13218)
UPDATE `criancas` SET `endereco` = 'RUA ANTONIO CONSELHEIROXXXX', `updated_at` = '2020-09-08 15:02:02' WHERE `id` = 13117

  def create_observacao_crianca
   t=params[:observacao_crianca]
    @observacao_crianca = ObservacaoCrianca.new(params[:observacao_crianca])
      t1=params[:observacao_crianca]
      @crianca = Crianca.find(session[:id_crianca])
      @observacao_crianca.crianca_id =@crianca.id
      @observacao_crianca.data = Time.now
      @observacao_crianca.funcionario = @observacao_crianca.funcionario + '('+ current_user.unidade.nome + ')'

      if @observacao_crianca.save
---
SELECT * FROM `criancas` WHERE (`criancas`.`id` = 13218)
INSERT INTO `observacao_criancas` (`funcionario`, `observacao`, `data`, `updated_at`, `crianca_id`, `created_at`) VALUES('(CC MAIRA)', 'testetetszstetet', '2020-09-03 14:04:38', '2020-09-03 17:04:38', 13218, '2020-09-03 17:04:38')

   def consultacrianca
     t=0
     if params[:type_of].to_i == 1
      if current_user.present?
         if (current_user.unidade_id == 53 or current_user.unidade_id == 52) then
                 #@criancas = Crianca.find( :all,:conditions => ["nome like ? AND status = 'NA_DEMANDA' AND recadastrada!=0" , "%" + params[:search1].to_s + "%"],:order => 'nome ASC, unidade_id ASC')
                  @criancas = Crianca.find( :all,:conditions => ["nome like ? AND nascimento >= ?  AND (grupo_id <> 6 AND  grupo_id <> 7) " , "%" + params[:search1].to_s + "%", DATAN2],:order => 'nome ASC, unidade_id ASC')

              else
                 #@criancas = Crianca.find( :all,:conditions => ["nome like ? AND status = 'NA_DEMANDA' AND recadastrada!=0 ", "%" + params[:search1].to_s + "%" ],:order => 'nome ASC')
                  @criancas = Crianca.find( :all,:conditions => ["nome like ?AND nascimento >= ?   AND (grupo_id <> 6 AND  grupo_id <> 7) ", "%" + params[:search1].to_s + "%", DATAN2 ],:order => 'nome ASC')

         end
      else
        @criancas = Crianca.find( :all,:conditions => ["nome like ?AND nascimento >= ?   AND (grupo_id <> 6 AND grupo_id <> 7) ", "%" + params[:search1].to_s + "%", DATAN2 ],:order => 'nome ASC')

      end
              @canceladas = Crianca.find( :all,:conditions => [" nome like ? AND status =? AND nascimento >= ?   AND (grupo_id <> 6 AND  grupo_id <> 7)",  "%" + params[:search1].to_s + "%" , 'CANCELADA', DATAN2],:order => 'nome ASC')
              @demandas = Crianca.find( :all,:conditions => [" nome like ? and status =? AND nascimento >= ?   AND (grupo_id <> 6 AND  grupo_id <> 7)",  "%" + params[:search1].to_s + "%" , 'NA_DEMANDA', DATAN2],:order => 'nome ASC')
              @matriculadas = Crianca.find( :all,:conditions => [" nome like ? and status =? AND nascimento >= ?    AND (grupo_id <> 6 AND  grupo_id <> 7) ",  "%" + params[:search1].to_s + "%" , 'MATRICULADA', DATAN2],:order => 'nome ASC')
        render :update do |page|
          page.replace_html 'criancas', :partial => "criancas"
        end
     else if params[:type_of].to_i == 2
              if (current_user.unidade_id == 53 or current_user.unidade_id == 52) then
                 @criancas = Crianca.find( :all,:conditions => ['status = ? AND recadastrada!=0 AND nascimento >= ?   AND (grupo_id <> 6 AND  grupo_id <> 7)', params[:crianca][:status], DATAN2],:order => 'nome ASC, unidade_id ASC')
              else
                 @criancas = Crianca.find( :all,:conditions => [" unidade_id = ? and status =? AND recadastrada!=0 AND nascimento >= ?  AND (grupo_id <> 6 AND  grupo_id <> 7)", current_user.unidade_id , params[:crianca][:status], DATAN2],:order => 'nome ASC')
---
SELECT * FROM `criancas` WHERE ( nome like '%sophia bernar%' and status ='MATRICULADA' AND nascimento >= '2015-04-01' AND (grupo_id <> 6 AND grupo_id <> 7) ) ORDER BY nome ASC
SELECT * FROM `unidades` WHERE ((tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) and (id not between 70 and 83) and (id <> 54) AND ativo = 1 ) ORDER BY nome

   def criancamat2pre
     t=0
     if params[:type_of].to_i == 1
        @criancas = Crianca.find( :all,:conditions => ["nome like ?  AND nascimento >= ? AND (grupo_id = 5 ) AND (regiao_id <> 999 AND regiao_id is not null ) AND status= 'NA_DEMANDA' AND regiao_id > 99", "%" + params[:search1].to_s + "%", DATAN2 ],:order => 'nome ASC')
        render :update do |page|
          page.replace_html 'criancas', :partial => "criancasmat2pre"
        end
     else if params[:type_of].to_i == 2

              @criancas = Crianca.find( :all,:conditions => ['regiao_id = ? AND recadastrada!=0 AND nascimento >= ?   AND (grupo_id = 5 ) and status= "NA_DEMANDA"', params[:crianca][:regiao], DATAN2],:order => 'nome ASC, unidade_id ASC')
---
SELECT * FROM `criancas` WHERE (nome like '%maria%'AND nascimento >= '2015-04-01' AND (grupo_id = 5 ) AND (regiao_id <> 999 AND regiao_id is not null ) AND status= 'NA_DEMANDA' AND regiao_id > 99) ORDER BY nome ASC
SELECT * FROM `regiaos` WHERE (`regiaos`.`id` = 104)

def consulta_classe

    if params[:type_of].to_i == 1
        w=session[:grupo]=params[:crianca][:grupo4_id]
        w1=session[:regiao]=params[:crianca][:regiao4_id]
        t=0
         @criancas = Crianca.find( :all,:conditions => ["status = 'NA_DEMANDA'  AND regiao_id=? AND grupo_id=? ",  session[:regiao], session[:grupo] ],:order => "servidor_publico DESC, transferencia DESC, trabalho DESC, declaracao DESC, autonomo DESC,  created_at ASC")
---
SELECT * FROM `criancas` WHERE (status = 'NA_DEMANDA' AND grupo_id='5' AND unidade_ref='CC MAIRA') ORDER BY servidor_publico DESC, transferencia DESC, trabalho DESC, declaracao DESC, autonomo DESC, created_at ASC
SELECT * FROM `grupos` WHERE (id <> 3) ORDER BY nome

  def mesmo_nome
    w=session[:nome] = params[:crianca_nome]
    @verifica = Crianca.find(:all, :conditions=> ['nome =? and (recadastrada = 2 OR recadastrada = 1 )',params[:crianca_nome]])
        t=0
    if @verifica.present? then
---
SELECT * FROM `criancas` WHERE (nome ='testeteteetetetetet' and (recadastrada = 2 OR recadastrada = 1 ))
SELECT * FROM `criancas` ORDER BY nome ASC

    def mesmo_nome_pre
    w=session[:nome] = params[:crianca_nome]
    @verifica = Crianca.find(:all, :conditions=> ['nome =? and (recadastrada = 2 OR recadastrada = 1 ) and (grupo_id = 6 or grupo_id = 7)',params[:crianca_nome]])
        t=0
    if @verifica.present? then
---
SELECT * FROM `criancas` WHERE (nome ='dsadssdadsa' and (recadastrada = 2 OR recadastrada = 1 ) and (grupo_id = 6 or grupo_id = 7))
SELECT * FROM `criancas` ORDER BY nome ASC

  def mesma_mae

     @verifica_mae = Crianca.find(:all, :conditions=> ['mae =?  and nome = ?',params[:crianca_mae], session[:nome]])
    # @verifica = Crianca.find(:all, :conditions=> ['nome =? AND (recadastrada = 2 OR recadastrada = 1) AND status != "MATRICULADA"',params[:crianca_nome]])

     if @verifica_mae.present? then
---
SELECT * FROM `criancas` WHERE (mae ='testeteteetetetetet novo' and nome = 'testeteteetetetetet')
SELECT * FROM `criancas` ORDER BY nome ASC

  def mesma_mae_pre

     @verifica_mae = Crianca.find(:all, :conditions=> ['mae =?  and nome = ?  and (grupo_id = 6 or grupo_id = 7)',params[:crianca_mae], session[:nome]])
      if @verifica_mae.present? then
       if Crianca.find_by_nome(session[:nome]) then
          @status_cri = Crianca.find(:all, :conditions=> ['nome =? and (status ="MATRICULADA" or status ="CANCELADA (Recadastramento)") ',session[:nome]])
---
SELECT * FROM `criancas` WHERE (mae ='adssdasda' and nome = 'dsadssdadsa' and (grupo_id = 6 or grupo_id = 7))
SELECT * FROM `criancas` ORDER BY nome ASC
SELECT * FROM `criancas` WHERE (nome ='TESTE' and (status ="MATRICULADA" or status ="CANCELADA (Recadastramento)") )

def impressao_pre
       @crianca = Crianca.find(:all,:conditions => ["id = ?",   session[:child]])
       @unidade_regiao= Unidade.find(:all , :conditions=>['regiao_id=? AND ativo = 1 AND ( tipo = 1 or tipo = 3 or tipo = 7 or tipo = 8)',@crianca[0].regiao_id])
---
SELECT * FROM `criancas` WHERE (id = 13796)
SELECT * FROM `unidades` WHERE ((tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) and (id not between 70 and 83) and (id <> 54) AND ativo = 1 ) ORDER BY nome

 def lista_bairros
    @unidade_regiao = Unidade.find(:all, :conditions => ['regiao_id=? AND ativo = 1 AND ( tipo = 1 or tipo = 3 or tipo = 7 or tipo = 8)', params[:crianca_regiao_id]])
---
SELECT * FROM `unidades` WHERE ((tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) and (id not between 70 and 83) and (id <> 54) AND ativo = 1) ORDER BY nome

 def pre_criancas

     if params[:type_of].to_i == 1
         data_pre = (DATAPRE2).to_s  #  data nascimento da criança que limita  matriculada na pré escola  a aprtir de ....
         data_pre = data_pre + ' 00:00:00'
         w=params[:search1]
         #@criancas_pre = Crianca.find( :all,:conditions => ["nome like ?  and  nascimento <= ?  and recadastrada > 0" , "%" + params[:search1].to_s + "%", data_pre ],:order => 'nome ASC, unidade_id ASC')
         @criancas_pre = Crianca.find( :all,:conditions => ["nome like ?  and  (grupo_id = 6 or grupo_id = 7  or (grupo_id = 5 and  regiao_id= 999 )) and recadastrada > 0" , "%" + params[:search1].to_s + "%"],:order => 'nome ASC, unidade_id ASC')
---
SELECT * FROM `criancas` WHERE (nascimento <= '2017-07-01 00:00:00' and recadastrada > 0 and (grupo_id = 6 or grupo_id = 7 or (grupo_id = 5 and regiao_id= 999 ))and (status='MATRICULADA') and created_at > '2020-09-09 00:00:00') ORDER BY nome ASC, grupo_id ASC

  def load_grupos
    @grupos =  Grupo.find(:all, :order => "nome")
---
SELECT * FROM `grupos` WHERE (id <> 3) ORDER BY nome

  def load_regiaos
    @regiaos =  Regiao.find(:all, :order => "nome")
---
SELECT * FROM `regiaos` WHERE (id > 99) ORDER BY nome

  def load_unidades
   if current_user.present?
    if current_user.unidade_id== 53 or current_user.unidade_id==52
       session[:unidade] = current_user.unidade_id
       @unidades1 =  Unidade.find(:all,  :conditions => ["(tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) AND ativo = 1" ],:order => "nome")
---
SELECT * FROM `unidades` WHERE ((tipo = 3 or tipo = 1 or tipo = 7 or tipo = 8) and (id not between 70 and 83) and (id <> 54) AND ativo = 1 ) ORDER BY nome

  def load_criancas
    @criancas = Crianca.find(:all, :order => "nome ASC")
---
SELECT * FROM `criancas` WHERE (`criancas`.`id` = 13657)